Table of Contents
 Class IdeaBoltAssembly
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaBoltAssembly : AbstractIdeaObject<IIdeaBoltAssembly>, IEquatable<AbstractIdeaObject<IIdeaBoltAssembly>>, IIdeaBoltAssembly, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaBoltAssembly>
IdeaBoltAssembly
Implements
IEquatable<AbstractIdeaObject<IIdeaBoltAssembly>>
IIdeaBoltAssembly
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaBoltAssembly>.Id
 AbstractIdeaObject<IIdeaBoltAssembly>.Name
 AbstractIdeaObject<IIdeaBoltAssembly>.Identifier
 AbstractIdeaObject<IIdeaBoltAssembly>.GetHashCode()
 AbstractIdeaObject<IIdeaBoltAssembly>.Equals(object)
 AbstractIdeaObject<IIdeaBoltAssembly>.Equals(AbstractIdeaObject<IIdeaBoltAssembly>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaBoltAssembly(Identifier<IIdeaBoltAssembly>)
protected IdeaBoltAssembly(Identifier<IIdeaBoltAssembly> identifier)
Parameters
identifier Identifier<IIdeaBoltAssembly>
 IdeaBoltAssembly(string)
public IdeaBoltAssembly(string id)
Parameters
id string
Properties
 BoreHole
Bore hole
public double BoreHole { get; set; }
Property Value
double
 DiagonalHeadDiameter
Diagonal head diametere
public double DiagonalHeadDiameter { get; set; }
Property Value
double
 Diameter
Diameter
public double Diameter { get; set; }
Property Value
double
 HeadDiameter
Head Diamete
public double HeadDiameter { get; set; }
Property Value
double
 HeadHeight
Head height
public double HeadHeight { get; set; }
Property Value
double
 HoleDiameter
Hole Diameter
public double HoleDiameter { get; set; }
Property Value
double
 Lenght
Lenght of bolt
public double Lenght { get; set; }
Property Value
double
 Material
Material of the plate.
public virtual IIdeaMaterial Material { get; set; }
Property Value
IIdeaMaterial
 NutThickness
Nut thickness
public double NutThickness { get; set; }
Property Value
double
 Standard
Standard
public string Standard { get; set; }
Property Value
string
 TensileStressArea
Tensile Stress Area
public double TensileStressArea { get; set; }
Property Value
double
 Edit this page